{
  "header": {
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  "home": {
    "hello": "Hello I'm Charlie 👋🏻",
    "job": "A Front-end Developer based in Brussels",
    "intro1": "I am a French web and app developer with a strong eye for innovative design and a keen understanding of techniques geared toward optimum user experience and low environmental impact.",
    "intro2": "I grew up in Paris and studied at IMT Atlantique in Nantes, France. I currently work in Bruxelles (Belgium) and I would like to continue to travel in a way to discover new cities and cultures.",
    "downloadResume": "Download my resume 📭",
    "skills": {
      "title": "My Skills",
      "subtitle": "Passionate about front-end development, UX/UI Design Enthusiast 💡",
      "skill1": {
        "title": "Front-end & Design",
        "description": "Front-end dev in HTML/CSS, Javascript, TypeScript and Design on Figma, Adobe XD, Illustrator"
      },
      "skill2": {
        "title": "Back-end & App",
        "description": "Back-end dev in Python, Node, Apollo/Express, Graphql, React, Flutter, Java, XML"
      },
      "skill3": {
        "title": "CMS",
        "description": "I can develop and configure Wordpress, Shopify, AWS and Docker"
      }
    },
    "projects": {
      "title": "My Projects",
      "subtitle": "Discover all the projects I’ve been working on during my internships, studies and my personals projects 🚀 ",
      "less": "Less projects",
      "more": "More projects"
    }
  },
  "project": {
    "launchWeb": "Launch website 🚀",
    "context": {
      "title": "Context 💡",
      "date": "Date",
      "company": "Company",
      "team": "Team"
    },
    "process": {
      "title": "Process 🚀"
    },
    "screens": {
      "title": "Screens 👌🏻"
    },
    "more": {
      "title": "More projects like this",
      "subtitle": "Take a look at other projects 🔎"
    }
  },
  "footer": {
    "title": "Want to know more?",
    "subtitle": "Let’s discuss around a cup of popcorn 🍿",
    "mail": "Mail : chpauvre@gmail.com",
    "tel": "Tel : +33 6 67 62 42 64"
  },
  "signature": {
    "madeWith": "Made with",
    "author": "by Charlie Pauvré"
  },
  "projects": {
    "arc": {
      "name": "Atlantic Robotic Club",
      "folderName": "arc",
      "description": "I developped a website in React to present the robot that the robotic club of my school is currently building to participate to the \"Coupe de France de robotique\" (French Robotics Cup)",
      "smallDescription": "Website for French Robotic Cup",
      "context": "I studied 3 years at IMT Atlantique, a french engineering school based in Nantes, Rennes and Brest. With some friends there, we revived the robotic club of the school and decided to participate to the \"Coupe de France de robotique\" (French Robotics Cup). My main task was to build this website: its purpose was to present to students that would come after us how we built our robot, what were our thinking, methods and decisions, so that they would be able to take over the club at the end of the year.",
      "date": "September 2020 - January 2021",
      "company": "IMT Atlantique",
      "web": "https://atlantic-robotic-club.netlify.app/",
      "github": "https://github.com/PAUVRE-Charlie/atlantic-robotic-club",
      "type": "Website",
      "tags": ["React"],
      "process": [
        "I started by gathering the articles and some data about the competition and the robot itself by talking with the team.",
        "Then, I explored the school website and social media to find the design system that would best fit the project. It appeared their main colors were light blue and gold.",
        "I did my design using Figma and after both my team and I were satisfied, I started to plan the coding part. I developed the website following a calendar and using React with Typescrit and Sass."
      ]
    },
    "barbart": {
      "name": "Barb'Art",
      "folderName": "barbart",
      "description": "I used Flutter to develop an app to centralize all the information necessary for life on our campus and let people enroll in sports and art clubs.",
      "smallDescription": "A flutter app for the Student Union of my school",
      "context": "During my Msc 1, with a good friend of mine, I decided to take on a new project. In our school, there are many different sources of information and people were often complaining about it. So we decided to create an app that would make every students' life easier. Its main goal is to gather the main announcements of the Student Union, but it was also to let people enroll in sports and art clubs and book the music room.",
      "date": "July 2020 - December 2020",
      "company": "BDE of IMT Atlantique",
      "team": [{"name": "Thomas Rossi", "link": "https://www.linkedin.com/in/thomas-rossi-fr/"}],
      "github": "https://github.com/ThomRI/BarbArt",
      "type": "App",
      "tags": ["Flutter", "Express", "MySQL"],
      "process": [
        "Our first weeks were about conceiving the project. We talked a lot with others students to understand what they really needed and wanted and then we designed the app on Figma.",
        "We divided the work in two : he was in charge of the backend and me the frontend. I used Flutter because I did not wanted to have to code 2 times the app, for android and IOS.",
        "We worked together for some months, sometimes remotely, and we achieved to create a first version of the app.",
        "Then, we both did not have the time to finish this project so we decided to pass the torch on to younger students of our school, that are still working on the project at this day."
      ]
    },
    "caps": {
      "name": "Caps",
      "folderName": "caps",
      "description": "With a friend, I designed the app on Figma and built it using Flutter. This app targets students and its purpose is to assist them when playing a game called Caps that is played with beer bottle capsules.",
      "smallDescription": "An app to assist them when playing a game called Caps",
      "context": "With another student of my class, when playing a game of Caps, a game played with beer bottle capsules, we felt like we could make the game easier to play with an app. With it, you can count the points of a game, create tournaments and see your ranking and stats.",
      "date": "January 2021 - March 2021",
      "company": "BDE of IMT Atlantique",
      "team": [{"name": "Pierre Schmutz", "link": "https://www.linkedin.com/in/pierre-schmutz/"}],
      "type": "App",
      "tags": ["Flutter", "Firestore"],
      "process": [
        "The first thing we did was to list the features we wanted in the app. Then we started to think about the architecture and the design of the app, which we did on Figma.",
        "We developed the app with Flutter and Firebase. I was in charge of handling the Firebase data and to link it to the app, but I also coded some screens.",
        "When we finished developing it, we started working on the deployment on the Playstore and App store. The app was available on Playstore during 4 months, before they decided to ban the app because it was too linked with drinking. We still are in negociations with them so that they let us publish the app again."
      ]
    },
    "dataneo": {
      "name": "Dataneo",
      "folderName": "dataneo",
      "description": "This website is used to add value to the data around cars and their owners, by accessing to some statistics and also by making the identification of cars really easy.",
      "smallDescription": "A website whose purpose is to add value to the data around cars and their owners",
      "context": "I worked on this project during my internship at Wolfox, alongside with Alexandre, my tutor. Our role was to implement the design from Figma files, that the designers at Wolfox created.",
      "date": "March 2021",
      "company": "Wolfox",
      "team": [{"name": "Alexandre Brajeux", "link": "https://www.linkedin.com/in/alexandre-brajeux/"}, {"name": "Eva Vermot", "link": "https://www.linkedin.com/in/eva-vermot-desroches-79b888154/"}],
      "web": "https://www.dataneo.fr/",
      "type": "Website",
      "tags": ["React", "Nodejs", "PostgreSQL"],
      "process": [
        "First, with Alexandre and the team at Dataneo, we used Excel to create a schedule.",
        "As their datamodel was not completely finished, we decided to create all screens with fake data we created ourselves.",
        "And in a last part, when the datamodel was complete, our role was to connect our frontend to the API."
      ]
    },
    "iki": {
      "name": "Iki",
      "folderName": "iki",
      "description": "I designed and developed a website for Iki, a restaurant in Ixelles (Belgium) that offer healthy and refined Eurasian cuisine.",
      "smallDescription": "The presentation, menu and order information of Iki, a restaurant based in Ixelles, Belgium.",
      "context": "Alongside my internship at Pricing Pact in Brussels, I met Tan Le, the owner of the restaurant and after some discussions, he asked me if I could update his website.",
      "date": "January 2022 - February 2022",
      "web": "https://iki-brussels.be/",
      "type": "Website",
      "tags": ["Gastby"],
      "process": [
        "The first thing we did was to meet one afternoon so he could tell me what he wanted, and send me all the necessary documents/images I needed.",
        "Then after looking up his previous website (https://ikisalads.be/en), I started designing the new website using Figma, and after a few meetings, we aggreed on the final mockups.",
        "After that I used Gastby to build the website. I had to link the website to some third-party apps like Typeform and Excel, so he could receive orders.",
        "As he wanted a website that did not impact badly the environment, I did some optimizations and connected the website to the website carbon evaluation engine (the result can be seen in the footer of the website)",
        "Finally, I uploaded the website on an OVH cloud solution."
      ]
    },
    "mangakan": {
      "name": "Mangakan",
      "folderName": "mangakan",
      "description": "With a friend, I am designing and developing an app whose goal is to help manga and manhwas readers keep tabs of what they are reading and at which chapter they are at.",
      "smallDescription": "An app for manga and manhwas readers to keep tabs of what they are reading and at which chapter they are at",
      "context": "During one of COVID lockdown I talked with Chloe, a friend of mine, and we came to the conclusion that it was a drag to keep tabs of the mangas and manwhas we were reading. After seeing there were not a satisfying solution on the stores, we decided to make our own.",
      "date": "April 2021 - now",
      "team": [{"name": "Chloé Oulabsir--Simonin", "link": "https://www.linkedin.com/in/chloe-oulabsir-simonin/"}, {"name": "Valentine Michel", "link": "https://www.linkedin.com/in/valentine-michel-ux-ui-designer-%C3%A9coconception/"}],
      "web": "https://mangakan.fr",
      "type": "Website & app",
      "tags": ["React native", "Graphql", "MongoDB"],
      "process": [
        "The first thing we did was to meet one afternoon and list every ideas that came to our mind. With that in mind, we created a notion workspace and started organizing our ideas. Simultaneously, we started to ask our friends about their needs and ideas concerning the app.",
        "Then we decided I was in charge of design, she of the database and that we would both work on the development of the app.",
        "I chose to use Figma to build my design, and I asked Valentine, a designer who is also a good friend, to help me with the design.",
        "I first started to code the landing page for which I used Gatsby, to have a very low environmental impact.",
        "Then, I started working on the application. I use React native, Mercurius, Graphql and MongoDB to implement the app. At this day, the app is soon to be published on the PlayStore and when everything will be working, I will start the publication on the AppStore."
      ]
    },
    "margarita": {
      "name": "Wedding website",
      "folderName": "margarita",
      "description": "The purpose of this website is to announce and host all the necessary information related to the future wedding of Bertrand & Margarita.",
      "smallDescription": "A website to announce and host all the necessary information related to a future wedding",
      "context": "While I was talking with Bertrand, I realized he was struggling with finding a good no-code solution to build the website for his wedding. It was especially due to the fact that he wanted interactivity and different languages available. When he explained it to me I offered him to build the website he wanted.",
      "date": "July 2022",
      "web": "https://www.margarita-et-bertrand.fr/",
      "type": "Website",
      "tags": ["Gastby"],
      "process": [
        "We first organized video calls so he and his fiance could describe what they wanted on their website.",
        "Then I started designing the website on Figma, and after some changes due to their feedbacks, we aggreed on the final mockups.",
        "After that, I started coding the website using Gastby and when they had checked everything was working the way they wanted, I uploaded the website on Netlify."
      ]
    },
    "tgeu": {
      "name": "Trans Rights Map",
      "folderName": "tgeu",
      "description": "I worked in a two person team with a designer during 1.5 months to build an interactive version of the Trans Rights Map in English and Russian, on the occasion of the International Day Against Homophobia, Biphobia, and Transphobia.",
      "smallDescription": "An interactive version of the Trans Rights Map in English and Russian",
      "context": "On the occasion of the International Day Against Homophobia, Biphobia, and Transphobia, TGEU (Trans Gender Europe) wanted to build a website that would represent the repartition of rights for transgender people in Europe & Central Asia. They wanted it as maps and the data they give us was in excel sheets format.",
      "date": "April - May 2021",
      "company": "Wolfox",
      "team": [{"name": "Mía Chávez Ruz", "link": "https://www.linkedin.com/in/miachavezruz/"}],
      "web": "https://transrightsmap.tgeu.org/",
      "type": "Website",
      "tags": ["Preact", "SVG"],
      "process": [
        "Firsly, Mia and I had a meeting with the TGEU team : they explained to us what they wanted, what were our data and how much time we had.",
        "Then, Mia focused on the design part. When she was done, I started to code. I used Preact, a lighter version of React, because they wanted their website light and respectful of the environment.",
        "My main focus was on SVGs, I learnt how to custom them, but also how to create a pinch and a zoom effect without plugins.",
        "I also add to create dynamic downloadable PDF files and images. In order to do that, I built manually canvas with SVG that I could export in both formats.",
        "This project was really great because I was directly in contact with the TGEU people that were really nice, because I learnt a lot but also because I am proud that I managed to build alone this website on such short notice (7 weeks)."
      ]
    },
    "ublo": {
      "name": "Ublo",
      "folderName": "ublo",
      "description": "Alongside designers and other developers, I built a property management solution for public lessors, using React and a REST api. I was also in charge of creating the docker containers and deploying them on AWS.",
      "smallDescription": "A management solution for public lessors",
      "context": "Nowadays, one of the last field still using more paper than digital files is real estate. That is why the ublo team decided to create this solution. It focuses on reducing costs for managers and improve the residants' experience.",
      "date": "June & July 2021",
      "company": "Ublo",
      "web": "https://www.ublo.immo/",
      "type": "Website",
      "tags": ["React", "Nodejs", "Docker", "MongoDB"],
      "process": [
        "First, I helped the team building many many components and screens, using React, Tailwind and Material UI.",
        "Then, they put me in charge of the statistics dashboard. Firstly I had to design it on Figma, I had to be careful because I had to follow the exising design system.",
        "When my design had been validated by the team, I started implementing it, first with fake data. Then I created the necessary requests in the backend and I linked it to the frontend.",
        "As soon as I was done with this mission, they put me in charge of containerizing the backend using Docker. I used a docker-compose file to link the backend with the MongoDB database. Finally, my last job was to deploy this container on AWS using the ECS module."
      ]
    },
    "valentine": {
      "name": "Valentine's blog",
      "folderName": "valentine",
      "description": "This website act as a blog for Valentine, a UX-UI designer who is working in Paris. It has a very low environemental impact and introduce her work and methods.",
      "smallDescription": "This website act as a blog for Valentine, a UX-UI designer who is working in Paris.",
      "context": "As Valentine wanted to start as a designer freelancer, she decided it was a good idea to create a blog where she could add articles about her ideas and methods.",
      "date": "June 2022",
      "web": "https://valentine.eco/",
      "type": "Blog",
      "tags": ["Gastby", "Strapi"],
      "process": [
        "First, we talked about what she wanted and how she wanted it. She showed me her design and insisted on the importance of having a website with a very low environmental impact.",
        "I decided to use the combination of Gatsby and Strapi. Why? Because Gastby is very light and efficient, and Strapi because it is a really easy to implement blog backend and it works well with Gastby."
      ]
    }
  }
}
